Tekla Open API Reference for Tekla Structures 2025
IPlacing Properties
The IPlacing type exposes the following members.
Properties
Name | Description
Placing
 The current placing of the object. See PlacingTypes for different placing options.
Top
See Also
Reference
IPlacing Interface
Tekla.Structures.Drawing Namespace